// Fill out your copyright notice in the Description page of Project Settings.

#pragma once

#include "CoreMinimal.h"
#include "GameFramework/Actor.h"
#include "ProjectP/Object/PPEventCaller.h"
#include "PPPasswordPuzzleWidgetActor.generated.h"

class UBoxComponent;
/*
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@:@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@$   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.  #  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@      =@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@        @@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@  ~  ,  .@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@  ~    -  @@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@-  ,    ,-  @@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@  ~      .  @@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@  ~.      .   @@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@           ~  ,@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@                @@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@:  $@,  @@   @#   @@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@   @@- .@@, ,@@   @@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@    @@~ ;@@: ~@@.   @@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@   :@@@@@@@@@@@@*   ~@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@    @@#:-;##**#@@@    @@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@=    @@@@@@@@@@@@@@     @@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@     @@@@@@@@@@@@@@     @@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@.     @@@@@@@@@@@@@@      @@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@      @@@@@###@@$@@@      *@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@  ,.   -@@@ ,-=@@@@@;       @@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@          @=@@@@@@       ,   @@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@  ,       :@@@@@@@@*       ~  @@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@.          @@@@@@@@@@        .  @@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@           @@@@@@@@@@        ~  $@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@  .         @@@@@@@@@@         ~  @@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@  ~        ~@@@@@@@@@@;        -  .@@@@@@@@@@@@@@
@@@@@@@@@@@@@@  ~         @@@@@@@@@@@@         .  @@@@@@@@@@@@@@
@@@@@@@@@@@@@~            @@@@@@@@@@@@         -   @@@@@@@@@@@@@
@@@@@@@@@@@@@  .          @@@  @@@@@@@          ,  #@@@@@@@@@@@@
@@@@@@@@@@@@   .         ~@@@;#@@@@@@@,          -  @@@@@@@@@@@@
@@@@@@@@@@@@  ,          @@@ $@@#@@;~$@             -@@@@@@@@@@@
@@@@@@@@@@@              @@=  @@@@@@@@@           ,  @@@@@@@@@@@
@@@@@@@@@@;              @ ---@@@@@@@@@           ,   @@@@@@@@@@
@@@@@@@@@@             $@,   -.=@@@@@@@@#             @@@@@@@@@@
@@@@@@@@@            :@@=  =@@@@@@@@@@@@@@             @@@@@@@@@
@@@@@@@@@  .         @@@   @@@@@@@@@@@@@@@@         ~  :@@@@@@@@
@@@@@@@@  ,         @@@$  -@@@@@@@@@@@@@@@@@            @@@@@@@@
@@@@@@@=        ~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@$.     ,   @@@@@@@
@@@@@@@  .                                            .  #@@@@@@
@@@@@@.        @  @ ~   @   =@ @  #,    * !  @$           @@@@@@
@@@@@@    @.   @  @:*=      @@# ! # @   ~$*, @$  @   @ :  *@@@@@
@@@@@          @  @ ~   ~.  @@  , #      $! ~@#  :         @@@@@
@@@@#  ,,,,,,,         -  .   .,    ,  .     . ,  ,,,,,,,  .@@@@
@@@@                                                        @@@@
@@@:--------------------------------------------------------,@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 */
class UPPPasswordPuzzleWidget;
class UWidgetComponent;

UCLASS()
class PROJECTP_API APPPasswordPuzzleWidgetActor : public AActor
{
	GENERATED_BODY()
	
public:	
	// Sets default values for this actor's properties
	APPPasswordPuzzleWidgetActor();

protected:
	// Called when the game starts or when spawned
	virtual void BeginPlay() override;
	virtual void NotifyActorBeginOverlap(AActor* OtherActor) override;
	virtual void NotifyActorEndOverlap(AActor* OtherActor) override;
	
public:	
	// Called every frame
	virtual void Tick(float DeltaTime) override;

protected:
	UPROPERTY(EditDefaultsOnly, BlueprintReadWrite, Category ="UI")
	float WidgetHalfWidthValue;
	
	UPROPERTY(EditDefaultsOnly, BlueprintReadWrite, Category ="UI")
	float WidgetWidthAddValue;
	
protected:
	UPROPERTY(EditDefaultsOnly, Category = "Widget")
	TObjectPtr<UWidgetComponent> PasswordPuzzleWidgetComponent;

	UPROPERTY(VisibleDefaultsOnly, Category = "Widget")
	TObjectPtr<UPPPasswordPuzzleWidget> PasswordPuzzleWidget;

	UPROPERTY(EditAnywhere, Category = "Gimmick")
	TObjectPtr<UPPEventCaller> EventCallerComponent;

	UPROPERTY(EditAnywhere, BlueprintReadWrite)
	TObjectPtr<UBoxComponent> TriggerBox;
	
	UPROPERTY(EditAnywhere, Category = "Gimmick", DisplayName = "정답 비밀번호")
	FString CorrectPassword;
	
private:
	FORCEINLINE void DeliverCorrectEvent() { EventCallerComponent->DeliverEvent(); }
	void DisplayWidgetBackgroundDelegate();
	void HideWidgetBackgroundDelegate();

private:
	FTimerHandle DisplayTimerHandle;

	FTimerHandle HideTimerHandle;
	
};
